print("{}은 {}이다. ({})".format(1 + 1, 3, False))

# 정수 출력
# :숫자d - 특정 칸에 출력
print("결과){:d},".format(1), "결과){:d}".format(-1))
print("결과){:3d},".format(1), "결과){:d}".format(-1))
print("결과){:5d},".format(1), "결과){:5d}".format(-1))

# :0숫자d - 빈칸을 0으로 채우기
print("결과){:0d},".format(2), "결과){:0d}".format(-2))
print("결과){:03d},".format(2), "결과){:03d}".format(-2))
print("결과){:05d},".format(2), "결과){:05d}".format(-2))

# :+숫자d - 기호를 뒤로 밀기
print("결과){:+d},".format(3), "결과){:+d}".format(-3))
print("결과){:+3d},".format(3), "결과){:+3d}".format(-3))
print("결과){:+5d},".format(3), "결과){:+5d}".format(-3))

# :공백숫자d - 기호부분 공백
print("결과){: d},".format(4), "결과){: d}".format(-4))
print("결과){: 3d},".format(4), "결과){: 3d}".format(-4))
print("결과){: 5d},".format(4), "결과){: 5d}".format(-4))

# :=+숫자d - 기호를 앞으로 밀기
print("결과){:=+d},".format(5), "결과){:=+d}".format(-5))
print("결과){:=+3d},".format(5), "결과){:=+3d}".format(-5))
print("결과){:=+5d},".format(5), "결과){:=+5d}".format(-5))

# :기호=숫자d - 양/음수 표시와 숫자 사이를 기호로 채우기
print("결과){:🙏=d},".format(6), "결과){:🙏=d}".format(-6))
print("결과){:🙏=3d},".format(6), "결과){:🙏=3d}".format(-6))
print("결과){:🙏=5d},".format(6), "결과){:🙏=5d}".format(-6))

# 부동 소수점 출력
# :숫자f - 빈칸 만들기
print("결과){:f},".format(123.4567), "결과){:f}".format(-123.4567))
print("결과){:2f},".format(123.4567), "결과){:2f}".format(-123.4567))
print("결과){:4f},".format(123.4567), "결과){:4f}".format(-123.4567))
print("결과){:9f},".format(123.4567), "결과){:9f}".format(-123.4567))
print("결과){:11f},".format(123.4567), "결과){:11f}".format(-123.4567))
print("결과){:12f},".format(123.4567), "결과){:12f}".format(-123.4567))
print("결과){:13f},".format(123.4567), "결과){:13f}".format(-123.4567))
print("결과){:14f},".format(123.4567), "결과){:14f}".format(-123.4567))
print("결과){:15f},".format(123.4567), "결과){:15f}".format(-123.4567))
print("결과){:16f},".format(123.4567), "결과){:16f}".format(-123.4567))

# :+숫자f - 해당 숫자만큼의 칸에 부호 추가하기
print("결과){:+2f},".format(123.4567), "결과){:+2f}".format(-123.4567))
print("결과){:+4f},".format(123.4567), "결과){:+4f}".format(-123.4567))
print("결과){:+9f},".format(123.4567), "결과){:+9f}".format(-123.4567))
print("결과){:+11f},".format(123.4567), "결과){:+11f}".format(-123.4567))
print("결과){:+12f},".format(123.4567), "결과){:+12f}".format(-123.4567))
print("결과){:+13f},".format(123.4567), "결과){:+13f}".format(-123.4567))
print("결과){:+14f},".format(123.4567), "결과){:+14f}".format(-123.4567))
print("결과){:+15f},".format(123.4567), "결과){:+15f}".format(-123.4567))
print("결과){:+16f},".format(123.4567), "결과){:+16f}".format(-123.4567))

# :+0숫자f - 해당 숫자 칸에 부호를 추가하고 0으로 채우기
print("결과){:+015f},".format(123.4567), "결과){:+015f}".format(-123.4567))

# :숫자.소수점f - 소수점 아래 자릿수 지정하기
print("결과){:15.1f},".format(123.4567), "결과){:15.1f}".format(-123.4567))
print("결과){:15.2f},".format(123.4567), "결과){:15.2f}".format(-123.4567))
print("결과){:15.3f},".format(123.4567), "결과){:15.3f}".format(-123.4567))
print("결과){:15.4f},".format(123.4567), "결과){:15.4f}".format(-123.4567))
print("결과){:15.5f},".format(123.4567), "결과){:15.5f}".format(-123.4567))
print("결과){:15.6f},".format(123.4567), "결과){:15.6f}".format(-123.4567))
print("결과){:15.7f},".format(123.4567), "결과){:15.7f}".format(-123.4567))
print("결과){:15.8f},".format(123.4567), "결과){:15.8f}".format(-123.4567))
print("결과){:15.9f},".format(123.4567), "결과){:15.9f}".format(-123.4567))
print("결과){:15.10f},".format(123.4567), "결과){:15.10f}".format(-123.4567))
print("결과){:15.11f},".format(123.4567), "결과){:15.11f}".format(-123.4567))
print("결과){:15.12f},".format(123.4567), "결과){:15.12f}".format(-123.4567))

# 의미 없는 소수점 제거하기
print("결과){},".format(32.0), "결과){}".format(-32.0))
print("결과){:g},".format(32.0), "결과){:g}".format(-32.0))